from typing import Dict

FIXED_QUESTIONS: Dict[int, str] = {
    1: "คุณรู้สึกกับเป้าหมายอย่างไร?",
    2: "คุณมองเห็นภาพความสำเร็จ เมื่อบรรลุเป้าหมายเป็นอย่างไร?",
    3: "ถ้าหากบรรลุเป้าหมายแล้ว คุณจะได้รับสิ่งดีๆ อะไรบ้าง?",
    4: "สถานการณ์ปัจจุบันเมื่อเทียบกับเป้าหมายแล้วขาดเรื่องอะไรบ้าง?",
    5: "ปัญหา/อุุปสรรค์ที่ยังทำให้เราไปไม่ถึงเป้าหมายมีเรื่องอะไรบ้าง?",
    6: "ถ้าต้องการไปให้ถึงเป้าหมาย มีแผนงานและวิธีการอย่างไร?",
    7: "คุณยังมีวิธีการอื่นๆ ที่เหมาะสมในการไปสู่เป้าหมายอย่างไร?",
    8: "คุณคิดว่าวิธีการที่เหมาะสมกับสถานการณ์นี้ คือวิธีการใด?",
    9: "คุณจะดำเนินการอย่างไร เพื่อให้บรรลุเป้าหมายตามต้องการ?",
}